In [4]:
import pandas as pd

# Data Transformation - Feature Engineering:

In [5]:
# Data Transformation - Feature Engineering:

data = pd.read_csv("raw_data.csv")
data

data2 = data.copy()
data2["tax"] = data2["income"].apply(lambda x : "20%" if x >= 50000 else "10%")

gender_map = {"Male": "M", "Female": "F", "Unknown": "U"}

data2["gender"] = data2["gender"].map(gender_map)

data2.assign(new_income = data2["income"] * 1.1)

data2

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  20%
1    1      John Doe  29.0     USA      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN     USA      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%

In [6]:
data2

    id          name   age country gender   income  tax
0    1      John Doe  29.0     USA      M  55000.0  20%
1    1      John Doe  29.0     USA      M  55000.0  20%
2    2    Jane Smith   NaN  Canada      F  62000.0  20%
3    3          Alex   NaN     USA      U  47000.0  10%
4    4  Maria Garcia  34.0   Spain      F      NaN  10%
5    5        Li Wei  27.0   China      M  51000.0  20%
6    6           NaN  45.0   India      F  73000.0  20%
7    7    Ahmed Khan  38.0     NaN      M  68000.0  20%
8    8    Rachel Lee  29.0     USA      F  62000.0  20%
9    9   Carlos Ruiz   NaN  Mexico      M  45000.0  10%
10  10   Emily Davis  31.0     USA    NaN  58000.0  20%

# Data Transformation - Other Methods:
- replace()
- rename(columns={old:new})
- sort_values()
- reset_index()
- rank()
- Reorder Columns

In [ ]:
# Data Transformation - Other Methods:

# Practice Set: Pandas
- Task: Shift id column to the end

In [ ]:
# Write your code below:

# Writing Data to CSV & JSON Files:

In [18]:
# Writing Data to CSV & JSON Files:

data3 = data.copy()

data3 = data3.drop_duplicates()
data3 = data3.fillna(0)

data3 = data3.sort_values("income")
data3 = data3.reset_index(drop=True)

data3.to_csv("sorted_data.csv")

In [17]:
data3

   id          name   age country   gender   income
0   4  Maria Garcia  34.0   Spain   Female      0.0
1   9   Carlos Ruiz   0.0  Mexico     Male  45000.0
2   3          Alex   0.0     USA  Unknown  47000.0
3   5        Li Wei  27.0   China     Male  51000.0
4   1      John Doe  29.0     USA     Male  55000.0
5  10   Emily Davis  31.0     USA        0  58000.0
6   2    Jane Smith   0.0  Canada   Female  62000.0
7   8    Rachel Lee  29.0     USA   Female  62000.0
8   7    Ahmed Khan  38.0       0     Male  68000.0
9   6             0  45.0   India   Female  73000.0

# Group by & Aggregation of Data:
- groupby()
- mean / sum / max / min / count / etc
- agg()

In [29]:
# Group by & Aggregation of Data:

data

data.groupby("country")["income"].mean()
data.groupby("country")["income"].min()
data.groupby("country")["income"].max()

data.groupby("gender")["income"].mean()
data.groupby("gender")["income"].max()

data.groupby("country")["income"].agg(["mean", "min", "max"])

            mean      min      max
country
Canada   62000.0  62000.0  62000.0
China    51000.0  51000.0  51000.0
India    73000.0  73000.0  73000.0
Mexico   45000.0  45000.0  45000.0
Spain        NaN      NaN      NaN
USA      55400.0  47000.0  62000.0

# Melt & Pivot for Reshaping in Pandas:

In [30]:
# Melt & Pivot for Reshaping in Pandas:

# --------------------------------------------
# 1. CREATE SAMPLE WIDE DATAFRAME
# --------------------------------------------
df = pd.DataFrame({
    "id": [1, 2],
    "Jan": [10, 20],
    "Feb": [12, 22],
    "Mar": [14, 24]
})

print("Original Wide DataFrame:\n", df, "\n")

# --------------------------------------------
# 2. MELT (Wide → Long Format)
# --------------------------------------------
df_melted = pd.melt(
    df,
    id_vars="id",          # Keep this column fixed
    var_name="Month",      # The melted column names move here
    value_name="Sales"     # The melted column values move here
)

print("After Melt (Long Format):\n", df_melted, "\n")

# --------------------------------------------
# 3. PIVOT (Long → Wide Format)
# --------------------------------------------
df_pivoted = df_melted.pivot(
    index="id",            # Rows
    columns="Month",       # New columns
    values="Sales"         # Values
)

print("After Pivot (Back to Wide):\n", df_pivoted, "\n")

# --------------------------------------------
# 4. OPTIONAL: FIX COLUMN INDEX AFTER PIVOT
# (Pivot creates a MultiIndex column sometimes)
# --------------------------------------------
df_pivoted = df_pivoted.reset_index()
df_pivoted.columns.name = None  # remove pivot column name

print("Cleaned Pivoted DataFrame:\n", df_pivoted)

Original Wide DataFrame:
    id  Jan  Feb  Mar
0   1   10   12   14
1   2   20   22   24

After Melt (Long Format):
    id Month  Sales
0   1   Jan     10
1   2   Jan     20
2   1   Feb     12
3   2   Feb     22
4   1   Mar     14
5   2   Mar     24

After Pivot (Back to Wide):
 Month  Feb  Jan  Mar
id
1       12   10   14
2       22   20   24

Cleaned Pivoted DataFrame:
    id  Feb  Jan  Mar
0   1   12   10   14
1   2   22   20   24